Revit 2027 API
FilterStringRule.RuleString Property
 The user-supplied string against which strings from a Revit document will be tested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RuleString { get; set; }
Public Property RuleString As String
	Get
	Set
public:
property String^ RuleString {
	String^ get ();
	void set (String^ value);
}
member RuleString : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FilterStringRule Class
Autodesk.Revit.DB Namespace